import { Component, OnInit } from '@angular/core';
import { ActivatedRoute } from '@angular/router';

@Component({
  selector: 'app-area-details',
  templateUrl: './area-details.component.html',
  styleUrls: ['./area-details.component.css'],
})
export class AreaDetailsComponent implements OnInit {
  area: any;

  // بيانات المناطق
  areas = [
    {
      id: 1,
      name: 'الحصن',
      description: `تقع على ارتفاع 640 متر عن سطح البحر والقسمان الغربي والجنوبي منها هضاب تتخللها مناطق سهليه والقسم الشرقي سهول زراعيه خصبه بعليه وتقدر مساحه اراضيها بــــــ ( 56 كم2) ويبلغ عدد سكان الحصن مع مخيم الشهيد عزمي المفتي ( 88325) الف نسمه ويستغل السكان المناطق السهليه في الزراعه ومن اهم معالم الحصن  تل الحصن ويقع في الجهة الشمالية من الحصن وبركة الحصن الرومانية .
      
مدينه الحصن من المدن العريقة والقديمة جدا ويوجد بها الكثير من الكناش والمعابد والاتفاق وخاصه في منطقة تل الحصين وما حوله وتعود هذه الآثار إلى العصر البرونري والنحاسي والحديدي وكذلك العصر الروماني وتعتبر من مدن الديكابوليس العشرة (ديون) . كما تأسست بلديه الحصن عام ١٩١٠ وهي من اوائل بلديات المملكة.
`,
      images: ['../../../assets/images/municipality/الحصن1.png', '../../../assets/images/municipality/الحصن2.jpg'],
    },
    {
      id: 2,
      name: 'الصريح',
      description: 'تقع على ارتفاع 600 متر عن سطح البحر وأراضيها هضاب ويغلب عليها عموما الطابع السهلي وتقدر مساحه أراضيها بـــــــ (28.5 كم2) ويبلغ عدد سكانها (67548) نسمه. وتمتاز الصريح بسهولها الشاسعة ذات التربة الحمراء الخصبة التي تمتد من شرق مدينة الأمير الحسن بن طلال الرياضية وامتداد شارع البتراء وانتهاء بجامعة العلوم والتكنولوجيا الأردنية , ويحدها من الشرق الرمثا ومن الغرب إربد وإيدون، ومن الشمال حوارة ومن الجنوب الحصن .',
      images: ['../../../assets/images/municipality/الصريح1.jpg'],
    },
    {
      id: 3,
      name: 'كتم',
      description: 'تقع على ارتفاع 800 متر عن سطح البحر تقع جنوب اربد على بعد 15 كيلو متر يحدها من الشمال الحصنن، والنعيمه من جهتي الجنوب والشرق وشطنا من الغرب وكتم منطقه جبليه مرتفعه تبلغ مساحه أراضيها (13 كم2) ويبلغ عدد سكانها (12968)  نسمه.',
      images: ['../../../assets/images/municipality/كتم1.jpg'],
    },
    {
      id: 4,
      name: 'النعيمه',
      description: 'تقع على ارتفاع 700 متر عن سطح البحر تقع إلى الجنوب الشرقي من اربد وتبعد عنها 20 كم وتقع النعيمه على منطقه مرتفعه وهي هضاب تحيط بها الاوديه من كافه الجهات وتقدر مساحه أراضيها بـــــ ( 85 كم2) جميعها صالحه للزراعة ويبلغ عدد سكانها (42770) نسمه ويحدها من الغرب شطنا ومن الجنوب بليلا ومن الشرق بريقا والخناصري ومن الشمال الحصن .',
      images: ['../../../assets/images/municipality/نعيمه1.jpg'],
    },
    {
      id: 5,
      name: 'شطنا',
      description: ` وتتبع شطنا لمنطقة الحصن ,  
تقع على ارتفاع 700 متر عن سطح البحر , على السفح الشرقي لجبل عجلون وهي منطقة جبلية يحدها من الشمال الحصن ومن الشرق النعيمة وكتم ومن الجنوب صخرة ومن الغرب طريق اربد عجلون وتبلغ مساحة اراضي شطنا ( 4كم2) وعدد سكانها (239) نسمة. 
`,
      images: ['../../../assets/images/municipality/شطنا1.jpg'],
    },
    {
      id: 6,
      name: 'ايدون',
      description: 'تقع على ارتفاع 650 م عن سطح البحر يحدها من الشمال اربد ومن الشرق الصريح وحواره ومن الغرب ناطفه ومن الجنوب الحصن وحبكه وتبلغ مساحه أراضيها (20كم2) ويبلغ عدد سكانها مع سكان منطقة عاليه (88150)  نسمه وتجدر الاشاره هنا إلى ان منطقه ايدون  محاديه بشكل مباشر لقصبه اربد حيث يفصل بينهما شارع الجامعه وعاده ما يحدث دمج من قبل الافراد في الأراضي التابعة لمنطقه أيدون والمناطق التابعة لقصبه اربد ',
      images: ['../../../assets/images/municipality/ايدون1.png', '../../../assets/images/municipality/ايدون2.jpg'],
    },
  ];

  constructor(private route: ActivatedRoute) { }

  ngOnInit() {
    const id = +this.route.snapshot.paramMap.get('id')!;
    this.area = this.areas.find((area) => area.id === id);
  }
}
